{
  "reviews": [
    {
      "id": "ivan-krysak-2025",
      "date": "2025-11-03",
      "displayName": "Іван Крисак",
      "displayNameType": "full_name",
      "marketingPermission": true,
      "ratings": {
        "mentorComfort": 10,
        "expectationsMatch": 10
      },
      "atmosphere": {
        "generalImpression": "Я був на менторстві у Івана. За декілька років плідної праці він навчив мене багатьом речам: розбиратися та аналізувати код, створювати власні сайти, навчатися та розвиватися самостійно у напрямку Frontend та багато чого іншого.\nЗдавалося, що складні речі на кшталт фреймворків, синтаксису мов програмування чи архітектури сайту пояснити важко і це вимагає великих зусиль для розуміння, але у Івана це виходило на всі 200%. Пояснювати важкі теми простими словами, наводячи зрозумілі асоціації, які дозволяють надзвичайно швидко опанувати новий матеріал, - є справжнім професіоналізмом.\nЯ однозначно рекомендую як і менторські уроки так і курси, які є на цьому сайті.",
        "likedStyle": "Простота пояснень, індивідуальний підхід під темп навчання.",
        "threeWords": "Продуктивна, спокійна, цікава"
      },
      "mentor": {
        "memorable": "Пояснення складних речей простими словами з наочними прикладами.",
        "bestInteraction": "Завжди готовий допомогти та швидко відповідав на запитання поза заняттями.",
        "feltSupport": "Так"
      },
      "experience": {
        "pleasantSurprise": "Постійний розвиток та оновлення навчальних матеріалів в темп розвитку технологій.",
        "improvements": "Можливо, проводити деякі заняття у форматі технічної співбесіди, щоб перевірити та закріпити знання.",
        "wowMoment": "Початок вивчення React та Next.js.",
        "stillUsing": "Більшість матеріалу (70–80%) використовую у роботі",
        "motivation": "Постійна підтримка, зрозумілі пояснення і цікаві завдання, особисте бажання."
      },
      "support": {
        "feedbackSufficient": "Так",
        "chatConvenience": "Рідко користувався чатом спільноти \"IT-Mentor\", але періодично знаходив корисні матеріали."
      },
      "recommendations": {
        "suggestions": "Ймовірно ще більше практики, застосування AI для навчання та роботи з ним як з інструментом.",
        "recommendWhy": "Так, курс дає хороші знання і напрямки для подальшого розвитку, як спеціаліста."
      }
    },
    {
      "id": "oleksandra-pavlenko-2025",
      "date": "2025-09-15",
      "displayName": "Олександра Павленко",
      "displayNameType": "full_name",
      "marketingPermission": true,
      "ratings": {
        "mentorComfort": 10,
        "expectationsMatch": 10
      },
      "atmosphere": {
        "generalImpression": "Класне, мені все сподобалось. З'явилась впевненість у власних силах, не страшно брати проєкти.",
        "likedStyle": "Підтримка, багато практики, атмосфера.",
        "threeWords": "Дружня, підтримуюча, надихаюча"
      },
      "mentor": {
        "memorable": "Розжовування матеріалу, підтримка, швидкі відповіді",
        "bestInteraction": "Отримання відповідей та роз'яснень незрозумілого.",
        "feltSupport": "Так, дякую за це"
      },
      "experience": {
        "pleasantSurprise": "Детальність, багато практики, актуальність інформації",
        "improvements": "Все сподобалось, нічого б не міняла",
        "wowMoment": "Коли змогла писати js самостійно, і воно працювало!",
        "stillUsing": "Все, періодично вертаюсь до уроків, повторюю.",
        "motivation": "Те, що змогла робити проєкти самостійно"
      },
      "support": {
        "feedbackSufficient": "Так, швидко й детально",
        "chatConvenience": "Зручно, чесно, не дуже використовую, бо часу не маю, але коли є час, переглядаю. Знаходжу свої питання, які хтось задає, та цікаву інформацію. Також приємно читати про чужі успіхі, та слідкувати за прогресом групи"
      },
      "recommendations": {
        "suggestions": "Мені все підійшло",
        "recommendWhy": "Так, порадила. Комплексність навчання, результативно, швидка підтримка ментора."
      }
    },
    {
      "id": "dima-2025",
      "date": "2025-10-20",
      "displayName": "Dima",
      "displayNameType": "first_name",
      "marketingPermission": true,
      "ratings": {
        "mentorComfort": 10,
        "expectationsMatch": 10
      },
      "atmosphere": {
        "generalImpression": "Найкращий курс, який доводилось вивчати. Інформація подана максимально деталізовано, к-сть інформація на 1м2 - неймовірна, а головне актуальна! Структура курсу дозволяє тобі ввійти в програмування максимально плавно і це круто. Так як я новачок і фактично познайомився з програмуванням через цей курс. Дядько Іван - дуже крутий ментор, завжди допомагає, відповідає по суті, якщо щось невиходить - пояснить і 10 разів.",
        "likedStyle": "Все. Стиль, подача матеріалу, гумор ментора, підтримка протягом курсу.",
        "threeWords": "Дружня, відверта, затишна"
      },
      "mentor": {
        "memorable": "Занурення в деталі та гумор ментора",
        "bestInteraction": "Все працювало чудово, важко виділити щось одне.",
        "feltSupport": "Звичайно. На всі питання які мав, отримав відповіді!"
      },
      "experience": {
        "pleasantSurprise": "Найбільше: кількість та якість матеріалу в порівнянні з ціною! Це скарб. Надзвичайно рідко можна знайти таку інформацію за такі маленькі гроші!",
        "improvements": "Хотілось побачити новий курс по Бекенду 🤞",
        "wowMoment": "Кожен урок по-своєму крутий! Важко виділити якийсь один, але ті, де більше гумору на уроках - найкращі! 😂",
        "stillUsing": "90% - це реальне «юзабіліті» в реальних проектах. Я б сказав би - це база!",
        "motivation": "Самодисципліна та мотивація завершувати справи, які почав."
      },
      "support": {
        "feedbackSufficient": "Більш ніж.",
        "chatConvenience": "Хотілось би окремий чат для тих хто займається з менторською підтримкою. Бо відчувається, такий вайб ніби група, що навчається на потоці - «обрані», хотілось би свій міні-чат, де можна було ділитись свою досягненнями з іншими, дивитись, як інші проходять ту саму інфу, які рішення вони застосовують і тд."
      },
      "recommendations": {
        "suggestions": "Зробити окремий міні-чат в тг, для людей які займаються з менторською підтримкою, це було б круто!",
        "recommendWhy": "Так, крута подача матеріалу, актуальна інформація, чудовий ментор!"
      }
    },
    {
      "id": "anonymous-2025",
      "date": "2025-12-03",
      "displayName": "Анонімно",
      "displayNameType": "anonymous",
      "marketingPermission": false,
      "ratings": {
        "mentorComfort": 8,
        "expectationsMatch": 10
      },
      "atmosphere": {
        "generalImpression": "Я поки ще навчаюсь, але на даному етапі враження позитивні. Навчаюсь з менторством, дивлюся відеозаписи групи.",
        "likedStyle": "Подобається, що студенти можуть відразу задавати питання під час заняття. Можна дізнатися щось цікаве додатково через питання студентів.",
        "threeWords": "Приємна, комфортна, підтримуюча"
      },
      "mentor": {
        "memorable": "Подобається поєднання способів як можеш отримати чи закріпити знання. Через заняття(відео), де достатньо практики та теорії. Через закріплення вивченого через прикріпленні матеріали до конкретної теми. Та іноді самі студенти своїми питаннями можуть підштовхнути ментора внести корективи в плани занять і зачепити додатково теми.",
        "bestInteraction": "Відкритість і простота самого викладача, неформальність: дещо знижує напругу, яку відчуваєш зазвичай як студент, коли хочеш поставити питання.",
        "feltSupport": "Так."
      },
      "experience": {
        "pleasantSurprise": "Приємно, що викладач може підбадьорювати під час занять, знижувати страх помилок чи експериментів.",
        "improvements": "Такого немає.",
        "wowMoment": "Я ще в процесі проходження курсу, але сподобалось, що все подається з прикладами на практиці. Також викладач може схематично зобразити ситуацію за допомогою інструментів для малювання, що буває вельми зручно для сприйняття, наприклад, на таких темах як flexbox.",
        "stillUsing": "Я ще проходжу курс, тож найчастіше згадую основи HTML/CSS і роботу з Flexbox.",
        "motivation": "Мене підтримує те, що матеріал можна проходити у власному темпі. Це знімає тиск і дозволяє не відмовлятися від навчання, навіть якщо йду повільно."
      },
      "support": {
        "feedbackSufficient": "Так, цілком.",
        "chatConvenience": "Так як вчусь окремо на менторстві — доступу до чату групи не мала. Зверталась до самого ментора, це було зручно."
      },
      "recommendations": {
        "suggestions": "Мені все подобається, поки не маю конкретних побажань щодо покращень.",
        "recommendWhy": "Так, якщо будуть знайомі зацікавлені в цій темі пораджу. Чудово викладений матеріал, все пояснюється. Жодного разу не стикалась з таким докладним і об'ємним курсом із таким співвідношенням ціни і якості."
      }
    },
    {
      "id": "viktor-udut-2025",
      "date": "2024-12-17",
      "displayName": "Віктор Удут",
      "displayNameType": "full_name",
      "marketingPermission": true,
      "ratings": {
        "mentorComfort": 10,
        "expectationsMatch": 10
      },
      "atmosphere": {
        "generalImpression": "Курс залишив дуже позитивне та натхненне враження. Було відчуття, що кожне заняття дає новий рівень розуміння й наближає до практичного застосування знань. Атмосфера була дружньою та підтримувальною, тому навчання проходило легко й цікаво.",
        "likedStyle": "Найбільше сподобалася структурованість та зрозуміле пояснення складних тем простими словами. Відчувалася справжня залученість викладача та бажання допомогти розібратися в матеріалі. Також дуже цінним було поєднання теорії та практики — усе відразу закріплювалось у коді.",
        "threeWords": "Дружня, мотивуюча, продуктивна"
      },
      "mentor": {
        "memorable": "Найбільше запам'яталася терплячість, увага до деталей та вміння пояснити тему з різних боків, поки вона не стане зрозумілою. Було відчуття, що ментор завжди поруч і готовий підтримати, незалежно від складності запитання.",
        "bestInteraction": "Найкраще працювала відкритість у спілкуванні та готовність пояснювати навіть найдрібніші моменти. Було легко ставити будь-які запитання, бо відповіді завжди були конкретними, зрозумілими та доброзичливими. Відчувалося справжнє бажання допомогти розібратися, а не просто \"відповісти формально\".",
        "feltSupport": "Так, підтримка відчувалася постійно. Ментор завжди реагував швидко, давав практичні поради, спрямовував у правильний бік і допомагав не застрягати на складних моментах. Це створювало відчуття впевненості й безпеки під час навчання."
      },
      "experience": {
        "pleasantSurprise": "Приємно здивувала атмосфера, гнучкість у поясненнях та індивідуальний підхід. Навіть складні теми ставали зрозумілими завдяки тому, що їх пояснювали простими прикладами й у різних форматах. Також сподобалося, що матеріал не був відірваний від реальних задач.",
        "improvements": "Можливо, хотілося б трохи більше структурованості в плануванні уроків і чіткішого розподілу часу між теорією та практикою. Інколи теми хотілося розгорнути глибше або отримати більше додаткових прикладів. Але загалом формат був комфортним.",
        "wowMoment": "Найбільший «вау»-ефект був тоді, коли складні теми раптом складалися в цілісну картину — коли я бачив, як теорія починає працювати в реальних завданнях. Особливо запам'ятався момент, коли вперше самостійно застосував нову концепцію й одразу отримав правильний результат. Це дуже мотивувало.",
        "stillUsing": "Найчастіше використовую практичні поради та підходи, які допомагають правильно структурувати роботу й не губитися в складних задачах. Також постійно повертаюся до прикладів, які ментор наводив під час уроків — вони стали своєрідною опорною точкою у навчанні.",
        "motivation": "Найбільше допомогло відчуття прогресу. Коли бачив, що навіть маленькі кроки дають результат, виникало бажання рухатися далі. Також підтримка ментора та можливість ставити будь-які запитання дуже знімали напругу і не давали \"вигоріти\"."
      },
      "support": {
        "feedbackSufficient": "Так, зворотного зв'язку було достатньо. Відповіді приходили швидко й по суті, а коментарі допомагали виправляти помилки та краще розуміти матеріал. Це створювало відчуття, що я не сам у процесі навчання.",
        "chatConvenience": "Допомогу у чаті отримувати було дуже зручно — можна було швидко уточнити деталь, перевірити ідею або попросити підказку. Такий формат значно пришвидшував навчання і додавав впевненості."
      },
      "recommendations": {
        "suggestions": "Можна додати трохи більше структурованих чеклістів або коротких підсумкових конспектів після певних блоків. Це допомогло б швидше повторювати матеріал і впорядковувати знання. Але загалом курс і так залишив дуже позитивне враження.",
        "recommendWhy": "Так, я б однозначно порадив цей курс. Він дає не лише знання, а й розуміння, як їх застосовувати на практиці. Менторський супровід, підтримка та доступні пояснення роблять навчання комфортним навіть у складних темах. Це той випадок, коли реально відчуваєш прогрес і бачиш результат."
      }
    },
    {
      "id": "igor-tsapov-2025",
      "date": "2025-12-01",
      "displayName": "Ігор Цапов",
      "displayNameType": "full_name",
      "marketingPermission": true,
      "ratings": {
        "mentorComfort": 9,
        "expectationsMatch": 9
      },
      "atmosphere": {
        "generalImpression": "Відмінне враження, ніяких претензій до Івана та його учнів. Було приємно з усіма спілкуватися та підтримувати контакт. Хтось активний у чаті, хтось, можливо, соромиться висловлювати свої думки... Загалом все ОК.",
        "likedStyle": "Принаймні Іван намагався донести свої знання і досвід до учнів. Це найголовніше!",
        "threeWords": "Дружня, доречні жарти"
      },
      "mentor": {
        "memorable": "Як кажуть - «З точністю до міліметра...»",
        "bestInteraction": "Доступна форма спілкування",
        "feltSupport": "Так. Не тільки Івана, але й учнів"
      },
      "experience": {
        "pleasantSurprise": "Вік учнів. Я був, напевно, наймолодший... ))",
        "improvements": "Якби можна було порівняти моє навчання в 2023 році з сьогоднішнім днем... Я впевнений - зараз багато чого в навчанні змінилося. І підхід, і темп, і сама форма... Знання - вони завжди залишаться знаннями.",
        "wowMoment": "Де Іван бере цікаві макети для нашого навчання. Для мене це було не просто «простори інтернету». Я тоді не знав, що є такі сайти для допомоги в навчанні. Там ще можна змагатися у верстці один з одним...",
        "stillUsing": "Ті самі знання, які вклав у мене Іван... Звичайно ж, я продовжую їх вдосконалювати...",
        "motivation": "А я і зараз її не втратив... Хоча для мене це навчання не було легким. Це як забіг на довгу дистанцію. Ти біжиш, а кінця і не видно... Я все ще біжу і мені просто цікаво."
      },
      "support": {
        "feedbackSufficient": "На зворотний зв'язок під час виконання завдань не скаржуся - часу достатньо.",
        "chatConvenience": "Хто мав можливість, той допомагав, іноді питання вирішувалося швидко... Все було зручно."
      },
      "recommendations": {
        "suggestions": "Як це можна зробити по-іншому або як цього не потрібно робити.",
        "recommendWhy": "Так. Як для мене - доступно, просто, без будь-яких прикрас..."
      }
    },
    {
      "id": "ruslana-yakymiv-2025",
      "date": "2025-12-01",
      "displayName": "Руслана Якимів",
      "displayNameType": "full_name",
      "marketingPermission": true,
      "ratings": {
        "mentorComfort": 10,
        "expectationsMatch": 10
      },
      "atmosphere": {
        "generalImpression": "Пройшла курс минулого року, але час від часу продивляюся знову і кожного разу знаходжу щось нове і цікаве, оскільки розкриття тем є дуже структуроване і глибоко розкрите. Подача матеріалу чітка і зрозуміла.",
        "likedStyle": "Найбільше імпонує підхід в подачі матеріалу, теми розкриваються глибоко, на питання відповідь дається настільки вичерпно, що для себе закриваєш декілька наступних питань. І сам підхід ментора Івана справді дружньоменторський, наставницький. Людина яка любить те що робить, передає не лише знання, але й любов до обраної професії.",
        "threeWords": "дружня, продуктивна, партнерська"
      },
      "mentor": {
        "memorable": "Зацікавленість у твоїх знаннях, ти не просто прослуховуєш курс, ти його вчиш",
        "bestInteraction": "Постійне відчуття що ти не сам і є наставник до якого можна звернутися із питаннями",
        "feltSupport": "Абсолютну і це було найкрутіше. Більше того, впевнена що і після закінчення до Івана можна звернутися за порадою."
      },
      "experience": {
        "pleasantSurprise": "Справжня зацікавленість ментора у засвоєнню інформації студентами",
        "improvements": "Все було справді достатньо",
        "wowMoment": "Для мене не урок а блок ванільного JS, після нього коли читала сторонні джерела я для себе відкрила що я їх розумію, не лише в межах курсу, а саму логіку і це було «вау»",
        "stillUsing": "До багатьох блоків періодично заглядаю і кожного разу знаходжу якусь нову фішку",
        "motivation": "Мабуть сам обраний напрямок і був мотивацією"
      },
      "support": {
        "feedbackSufficient": "Впевнено достатньо",
        "chatConvenience": "Зручно"
      },
      "recommendations": {
        "suggestions": "Я думаю що вдосконаленню немає меж, але той рівень який є зараз справді достатній",
        "recommendWhy": "Однозначно ТАК. Маю досвід багатьох курсів, то цей один із найкращих. Тому ТАК."
      }
    },
    {
      "id": "alisa-2025",
      "date": "2025-12-01",
      "displayName": "Alisa",
      "displayNameType": "first_name",
      "marketingPermission": true,
      "ratings": {
        "mentorComfort": 9,
        "expectationsMatch": 7
      },
      "atmosphere": {
        "generalImpression": "Позитивне враження. Як для початку і ознайомлення з світом програмування - 70% курсу зрозуміло.",
        "likedStyle": "Напевно домашні завдання - які давали змогу - «навчатись думати»",
        "threeWords": "Докладна, Дослідницька, Підтримуюча"
      },
      "mentor": {
        "memorable": "Бажання, щоб учні зрозуміли тему",
        "bestInteraction": "Ментор не підкаже одразу, а направить в якому напрямку шукати вирішення",
        "feltSupport": "Так"
      },
      "experience": {
        "pleasantSurprise": "",
        "improvements": "Java Script, React. Якщо з першим щось більш-менш виходить - то з React - я таки не досягнула поки того рівня щоб його зрозуміти",
        "wowMoment": "Java Script - запам'яталось калькулятор чайових. Голову я думала що зламаю",
        "stillUsing": "HTML, CSS, JS",
        "motivation": "Коли в домашці дійсно щось виходить"
      },
      "support": {
        "feedbackSufficient": "Так, скоріш за все я не так часто зверталась, як потрібно було, для більшого розуміння",
        "chatConvenience": "Достатньо зручно - і багато читала як хтось вирішує інші таски"
      },
      "recommendations": {
        "suggestions": "Можливо, якось більше приділити увагу саме щоб розуміти як працює JS. Можливо більш легкі задачі і потім поєднувати одне з одним. Можливо більше в напрямку саме як це можливо розробити...",
        "recommendWhy": "Для вивчення HTML CSS JS - напевно так. Для JS - необхідно багато часу, скоріш за все я порадила ще опрацювання з різних уроків/завдань/книжок"
      }
    },
    {
      "id": "marianna-2025",
      "date": "2025-12-01",
      "displayName": "Маріанна",
      "displayNameType": "first_name",
      "marketingPermission": true,
      "ratings": {
        "mentorComfort": 10,
        "expectationsMatch": 10
      },
      "atmosphere": {
        "generalImpression": "Дуже позитивне, підтягнула базу, дізналась про нюанси",
        "likedStyle": "Чітке пояснення, проговорення відмінностей, звертання уваги на різні аспекти",
        "threeWords": "Комфортна, дружня, не скучно"
      },
      "mentor": {
        "memorable": "Наведення прикладів та бажання донести знання щоб всі зрозуміли",
        "bestInteraction": "Все",
        "feltSupport": "Так"
      },
      "experience": {
        "pleasantSurprise": "Проговорення всього, повернення назад до матеріалів, якщо щось не до кінця зрозуміло та позитивне налаштування щоб не втрачали мотивацію",
        "improvements": "Напевно, ні",
        "wowMoment": "Подобались тестові питання по знанням з попереднього уроку",
        "stillUsing": "Надана велика кіпа матеріалів, вивчати ще і вивчати. Згадую перевірку домашок)",
        "motivation": "Ментор постійно зацікавлював"
      },
      "support": {
        "feedbackSufficient": "Так, було достатньо",
        "chatConvenience": "Зручно"
      },
      "recommendations": {
        "suggestions": "",
        "recommendWhy": "Так, бо маю з чим порівняти, це поки що найкращий курс."
      }
    },
    {
      "id": "yaroslav-2025",
      "date": "2025-12-01",
      "displayName": "Ярослав",
      "displayNameType": "first_name",
      "marketingPermission": true,
      "ratings": {
        "mentorComfort": 9,
        "expectationsMatch": 10
      },
      "atmosphere": {
        "generalImpression": "Дружня атмосфера, зрозумілі пояснення, багато коду і... трохи гумору )",
        "likedStyle": "Найбільше сподобалось, що ментор не спішить, детально пояснює кожну незрозумілу частину теми, з прикладами та ментальними моделями. Зручний доступ до матеріалів курсу.",
        "threeWords": "Цікава, продуктивна, командна"
      },
      "mentor": {
        "memorable": "Детальне пояснення коду з прикладами з реального життя, пунктуальність, зв'язок (майже миттєвий)",
        "bestInteraction": "Найкраще працювала перевірка домашніх завдань, де ментор звертав увагу на помилки, допомагав покращити код",
        "feltSupport": "Так, підтримка і зв'язок були постійними, іноді й пізно ввечері"
      },
      "experience": {
        "pleasantSurprise": "Складні речі стають набагато простішими, коли їх доступно пояснить майстер своєї справи",
        "improvements": "",
        "wowMoment": "",
        "stillUsing": "Vite, React, React Router, TailwindCSS.",
        "motivation": "Мотивацію втратити важко, бо кожен урок і тема цікаві."
      },
      "support": {
        "feedbackSufficient": "Так",
        "chatConvenience": "10 з 10"
      },
      "recommendations": {
        "suggestions": "",
        "recommendWhy": "Пораджу однозначно якщо ви: 1) хочете створювати гарні вебсторінки та вебдодатки 2) готові робити домашні завдання 3) будете практикуватися самостійно"
      }
    },
    {
      "id": "vladyslav-menchynskyi-2025",
      "date": "2025-12-01",
      "displayName": "Владислав Менчинський",
      "displayNameType": "full_name",
      "marketingPermission": true,
      "ratings": {
        "mentorComfort": 10,
        "expectationsMatch": 10
      },
      "atmosphere": {
        "generalImpression": "Я поки ще навчаюсь, вже потрішки підходжу до кінця, але враження просто супер, мені подобається подача матеріалу, я б сказав за мене пожували, поклали в рот мені тільки проковтнути",
        "likedStyle": "Сподобалось те що все повторюється по декілька разів і відразу ж практикуєш, без сухого матеріалу",
        "threeWords": "Весела, домашня, продуктивна"
      },
      "mentor": {
        "memorable": "Що він зацікавлений навчити, це відчувається",
        "bestInteraction": "Важко щось сказати, бо я не можу виділити що було щось погано",
        "feltSupport": "Так звичайно"
      },
      "experience": {
        "pleasantSurprise": "Практика, що її реально багато",
        "improvements": "Я сам собі регулював темп, тому важко щось сказати, мені було комфортно і це найважливіше",
        "wowMoment": "Напевно коли сам почав щось робити в JS, і розуміти що я пишу, от це було ВАУ",
        "stillUsing": "Так як я ще навчаюсь, то використовую все",
        "motivation": "Моя робота, там де я зараз працюю, мене дуже мотивує щось змінити в житті"
      },
      "support": {
        "feedbackSufficient": "Я отримував весь зворотній зв'язок що потребував, тому так",
        "chatConvenience": "Спілкування в телеграмі для мене це супер"
      },
      "recommendations": {
        "suggestions": "Як для мене, то нічого",
        "recommendWhy": "Так звичайно, бо я його проходжу сам, я бачу подачу матеріалу, зацікавленість мене навчити"
      }
    }
  ]
}
