[
  {
    "id": 1,
    "name": "Олена Петренко",
    "city": "Київ",
    "courseName": "Повний курс Frontend-розробка",
    "text": "Дуже задоволена курсом! Матеріал подається структуровано і зрозуміло. Ментор завжди на зв'язку і допомагає з усіма питаннями. Вже знайшла свою першу роботу!"
  },
  {
    "id": 2,
    "name": "Максим Іванов",
    "city": "Львів",
    "courseName": "Курс HTML/CSS",
    "text": "Як дизайнер, я хотів краще розуміти верстку. Цей курс перевершив мої очікування. Тепер я можу не тільки створювати макети, але й втілювати їх у життя."
  },
  {
    "id": 3,
    "name": "Анна Ковальчук",
    "city": "Одеса",
    "courseName": "Курс JavaScript/TypeScript + React/Next.js",
    "text": "Прийшла на курс з базовими знаннями HTML. Зараз впевнено працюю з React та TypeScript. Практичні завдання та проекти дали величезний досвід."
  },
  {
    "id": 4,
    "name": "Сергій Бондаренко",
    "city": "Харків",
    "courseName": "Повний курс Frontend-розробка",
    "text": "Найкраща інвестиція у власну освіту. Гнучкий графік з менторством дозволив поєднувати навчання з роботою. Рекомендую всім, хто хоче стати розробником."
  },
  {
    "id": 5,
    "name": "Ірина Ткаченко",
    "city": "Дніпро",
    "courseName": "Курс HTML/CSS",
    "text": "Ніколи не думала, що зможу кодувати. Курс для початківців просто чудовий, все пояснюють з нуля. Дуже дякую!"
  },
  {
    "id": 6,
    "name": "Андрій Шевченко",
    "city": "Запоріжжя",
    "courseName": "Повний курс Frontend-розробка",
    "text": "Перейшов в IT з іншої сфери. Було складно, але менторська підтримка на курсі допомогла не здатися. Зараз працюю junior-розробником."
  },
  {
    "id": 7,
    "name": "Юлія Мельник",
    "city": "Вінниця",
    "courseName": "Курс JavaScript/TypeScript + React/Next.js",
    "text": "Курс дуже інтенсивний, багато практики. Саме те, що було потрібно для поглиблення знань після самостійного вивчення основ."
  },
  {
    "id": 8,
    "name": "Олександр Поліщук",
    "city": "Чернігів",
    "courseName": "Повний курс Frontend-розробка",
    "text": "Структура курсу, якість матеріалів та фідбек по домашнім завданням на найвищому рівні. 10/10."
  },
  {
    "id": 9,
    "name": "Наталія Гриценко",
    "city": "Херсон",
    "courseName": "Курс HTML/CSS",
    "text": "Пройшла курс, щоб оновити свої знання. Дізналася багато нового про сучасні підходи до верстки, Flexbox та Grid."
  },
  {
    "id": 10,
    "name": "Володимир Саєнко",
    "city": "Полтава",
    "courseName": "Повний курс Frontend-розробка",
    "text": "Дуже сподобався модуль по React та Next.js. Складні теми пояснюються простими словами. Рекомендую!"
  },
  {
    "id": 11,
    "name": "Тетяна Кравченко",
    "city": "Суми",
    "courseName": "Курс JavaScript/TypeScript + React/Next.js",
    "text": "Курс допоміг систематизувати знання та отримати впевненість у своїх силах. TypeScript тепер не здається таким страшним."
  }
]
